#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/m-oka-system/terraform-dynamic-credentials/runs/run-jDRWHGT9buEEtDZs

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_virtual_network.example: Drift detected (update)
azurerm_resource_group.example: Drift detected (update)
azurerm_subnet.example: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.webappcontainer will be created
  + resource "azurerm_role_assignment" "webappcontainer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.example will be created
  + resource "azurerm_user_assigned_identity" "example" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "example-mngid"
      + principal_id        = (known after apply)
      + resource_group_name = "exampleTFResourceGroup"
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 2 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @m-oka-system, Action: `pull_request`*